sterentev/atdf-device-asm-include/inc/AT90CAN128.inc
; ----------	Register ASSR bits		------------------------
.equ	EXCLK		= 4		; 0x10 - Enable External Clock Interrupt
.equ	AS2		= 3		; 0x08 - AS2: Asynchronous Timer/Counter2
.equ	TCN2UB		= 2		; 0x04 - TCN2UB: Timer/Counter2 Update Busy
.equ	OCR2UB		= 1		; 0x02 - Output Compare Register2 Update Busy
.equ	TCR2UB		= 0		; 0x01 - TCR2UB: Timer/Counter Control Register2 Update Busy



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCR bits		------------------------
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
.equ	WDP_MASK	= 0x07		;      - Watch Dog Timer Prescaler bits (3 bits)
.equ	WDP0		= 0		;          WDP BIT0 position
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 16K
;			0x01		; Oscillator Cycles 32K
;			0x02		; Oscillator Cycles 64K
;			0x03		; Oscillator Cycles 128K
;			0x04		; Oscillator Cycles 256K
;			0x05		; Oscillator Cycles 512K
;			0x06		; Oscillator Cycles 1024K
;			0x07		; Oscillator Cycles 2048K



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Reserved
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	ADHSM		= 7		; 0x80 - ADC High Speed Mode
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Sources (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - ADC7 Digital input Disable
.equ	ADC6D		= 6		; 0x40 - ADC6 Digital input Disable
.equ	ADC5D		= 5		; 0x20 - ADC5 Digital input Disable
.equ	ADC4D		= 4		; 0x10 - ADC4 Digital input Disable
.equ	ADC3D		= 3		; 0x08 - ADC3 Digital input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0 Digital input Disable



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADCSRB bits		------------------------
.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable

; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	CAN MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register CANGCON bits		------------------------
.equ	ABRQ		= 7		; 0x80 - Abort Request
.equ	OVRQ		= 6		; 0x40 - Overload Frame Request
.equ	TTC		= 5		; 0x20 - Time Trigger Communication
.equ	SYNTTC		= 4		; 0x10 - Synchronization of TTC
.equ	LISTEN		= 3		; 0x08 - Listening Mode
.equ	TEST		= 2		; 0x04 - Test Mode
.equ	ENASTB		= 1		; 0x02 - Enable / Standby
.equ	SWRES		= 0		; 0x01 - Software Reset Request

; ----------	Register CANGSTA bits		------------------------
.equ	OVRG		= 6		; 0x40 - Overload Frame Flag
.equ	TXBSY		= 4		; 0x10 - Transmitter Busy
.equ	RXBSY		= 3		; 0x08 - Receiver Busy
.equ	ENFG		= 2		; 0x04 - Enable Flag
.equ	BOFF		= 1		; 0x02 - Bus Off Mode
.equ	ERRP		= 0		; 0x01 - Error Passive Mode

; ----------	Register CANGIT bits		------------------------
.equ	CANIT		= 7		; 0x80 - General Interrupt Flag
.equ	BOFFIT		= 6		; 0x40 - Bus Off Interrupt Flag
.equ	OVRTIM		= 5		; 0x20 - Overrun CAN Timer
.equ	BXOK		= 4		; 0x10 - Burst Receive Interrupt
.equ	SERG		= 3		; 0x08 - Stuff Error General
.equ	CERG		= 2		; 0x04 - CRC Error General
.equ	FERG		= 1		; 0x02 - Form Error General
.equ	AERG		= 0		; 0x01 - Acknowledgement Error General

; ----------	Register CANGIE bits		------------------------
.equ	ENIT		= 7		; 0x80 - Enable all Interrupts
.equ	ENBOFF		= 6		; 0x40 - Enable Bus Off INterrupt
.equ	ENRX		= 5		; 0x20 - Enable Receive Interrupt
.equ	ENTX		= 4		; 0x10 - Enable Transmit Interrupt
.equ	ENERR		= 3		; 0x08 - Enable MOb Error Interrupt
.equ	ENBX		= 2		; 0x04 - Enable Burst Receive Interrupt
.equ	ENERG		= 1		; 0x02 - Enable General Error Interrupt
.equ	ENOVRT		= 0		; 0x01 - Enable CAN Timer Overrun Interrupt

; ----------	Register CANEN2 bits		------------------------
.equ	CANEN2_ENMOB_MASK= 0xFF		;      - Enable MOb (8 bits)
.equ	CANEN2_ENMOB0	= 0		;          CANEN2_ENMOB BIT0 position

